import React from "react";
import { Tab, Tabs } from "react-bootstrap";

function GroupPage() {
    return (
        <div className="mt-4">
            <div className="d-flex justify-content-start align-items-center">
                <img
                    src="/images/telegram.png"
                    alt="telegram"
                    height={150}
                    width={150}
                />
                <div>
                    <h3>گروه تلگرامی</h3>
                    <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت </p>
                    <div className="d-flex">
                        <button className="btn btn-outline-success">لینک کانال</button>
                        <button className="btn btn-outline-primary me-2">
                            ادمین کانال
                        </button>
                    </div>
                </div>
            </div>
            <div className="mt-5">
                <Tabs
                    defaultActiveKey="home"
                    id="uncontrolled-tab-example"
                    className="mb-3 w-100 p-0"
                >
                    <Tab eventKey="home" title="توضیحات">
                        <p>
                            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                            استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                            در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                            نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                            کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
                            جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
                            طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان
                            فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                            موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
                            نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل
                            دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
                        </p>
                    </Tab>
                    <Tab eventKey="profile" title="نظرات">
                        <p>
                            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                            استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                            در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                            نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                            کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
                            جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
                            طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان
                            فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                            موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
                            نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل
                            دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
                        </p>
                    </Tab>
                </Tabs>
            </div>
        </div>
    );
}

export default GroupPage;
